<?php
return [
    //订单状态
    'order_status'            => [
        '0' => '已取消',
        '1' => '待付款',
        '2' => '待发货',
        '3' => '已发货',
        '4' => '已完成',
    ],
    //入库单
    'supply_order_status'     => [
        '0' => '已取消',
        '1' => '待入库',
        '2' => '部分入库',
        '3' => '已完成',
    ],
    //退款单
    'refund_status'           => [
        '0' => '已取消',
        '1' => '待审核',
        '2' => '待付款',
        '3' => '已完成',
    ],
    //退货入库单
    'return_status'           => [
        '0' => '已取消',
        '1' => '待审核',
        '2' => '待收货',
        '3' => '待付款',
        '4' => '已完成',
    ],
    //货品状态
    'product_status'          => [
        '0' => '待审核',
        '1' => '已上架',
        '2' => '已下架',
        '3' => '审核失败',
        '4' => '违规',
    ],
    //档口状态
    'store_status'            => [
        '0' => '已休息',
        '1' => '营业中',
    ],
    //商户状态
    'merchant_status'         => [
        '0' => '待审核',
        '1' => '正常',
        '2' => '已关闭',
    ],
    //会员认证状态
    'member_verify_status'    => [
        '0' => '待认证',
        '1' => '已认证',
        '2' => '认证失败',
    ],
    //会员状态
    'member_status'           => [
        '0' => '黑名单',
        '1' => '正常',
    ],
    //站点状态
    'site_status'             => [
        '0' => '已关闭',
        '1' => '招商中',
        '2' => '运营中',
        '3' => '装修中',
    ],
    //运营商状态
    'operator_status'         => [
        '0' => '待审核',
        '1' => '正常',
        '2' => '已退出',
    ],
    //门店状态
    'shop_status'             => [
        '0' => '关门',
        '1' => '营业中',
    ],
    //促销活动状态
    'promotion_status'        => [
        '0' => '已取消',
        '1' => '正常',
        '2' => '已结束',
    ],
    //促销活动审核状态
    'promotion_verify_status' => [
        '0' => '待审核',
        '1' => '审核成功',
        '2' => '审核失败',
    ],
    //支付状态
    'pay_status'              => [
        '0' => '待付款',
        '1' => '付款成功',
        '2' => '付款失败',
    ],
    //代金券状态
    'coupon_status'           => [
        '0' => '未使用',
        '1' => '已使用',
        '2' => '已过期',
    ],


];